<template>
  <div class="faqs">
    <page-header :title="'Вопросы и ответы'" :image="'Slide_4.jpg'" :text="'Полезная информация'"
    ></page-header>
    <div class="faqs__container _container">
      <div class="faqs__wrapper">
        <advantages-component :advantages="advantages"></advantages-component>
        <faqs-info :faq="faq" @toggle="toggleAccordion($event)"></faqs-info>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import PageHeader from '@/components/page-header/page-header.vue'
import type { IFaq } from '@/domain/interfaces/IFaq.interface'
import type { Ref } from 'vue'
import { ref } from 'vue'
import FaqsInfo from '@/components/faqs-info/faqs-info.vue'
import AdvantagesComponent from '@/components/advantages-component/advantages-component.vue'
const faq: Ref<IFaq[]> = ref([
  {
    id: 1,
    question: 'Как я могу зарегистрироваться на мероприятие??',
    answer:
      ' Для регистрации на мероприятие перейдите на страницу события и найдите кнопку "Записаться на мероприятие". Заполните необходимые данные и следуйте указаниям для завершения процесса регистрации.',
    isActive: false
  },
  {
    id: 2,
    question: 'Могу ли я отменить или изменить свою регистрацию на мероприятие??',
    answer:
      'Да, вы можете отменить или изменить свою регистрацию на мероприятие. Для этого обратитесь к разделу "Мой профиль" на сайте и найдите информацию о своей регистрации. Там вы сможете выполнить необходимые действия.',
    isActive: false
  },
  {
    id: 3,
    question: 'Какие формы оплаты принимаются для покупки билетов??',
    answer:
      'Мы принимаем различные формы оплаты, включая кредитные карты, банковские переводы и электронные кошельки. Вам будет предоставлена возможность выбрать подходящий вариант оплаты во время процесса покупки билетов.',
    isActive: false
  },
  {
    id: 4,
    question: 'Что включено в стоимость билета??',
    answer:
      'Стоимость билета включает доступ к основным мероприятиям, указанным в программе. Однако, некоторые дополнительные мероприятия или услуги могут потребовать дополнительной оплаты. Подробная информация будет указана на странице события.',
    isActive: false
  },
  {
    id: 5,
    question: 'К Как получить подтверждение о регистрации и билеты на мероприятие?',
    answer:
      'После успешной регистрации на мероприятие вы получите подтверждение на указанный вами электронный адрес. Ваш билет может быть доступен для скачивания или распечатки через ваш профиль на сайте, или вам будет предоставлен билет на входе на мероприятие.',
    isActive: false
  },
  {
    id: 6,
    question:
      'Как связаться с организаторами мероприятия для получения дополнительной информации??',
    answer:
      'Вы можете связаться с организаторами мероприятия, используя контактную информацию, указанную на странице события или на сайте в разделе "Контакты". Вы также можете отправить запрос через форму обратной связи на сайте.',
    isActive: false
  },
  {
    id: 7,
    question: 'Могу ли я передать свой билет другому человеку, если не смогу посетить мероприятие?',
    answer:
      'Возможность передачи билета другому человеку может зависеть от политики мероприятия. Проверьте правила и инструкции на странице события или свяжитесь с организаторами для получения дополнительной информации.',
    isActive: false
  },
  {
    id: 8,
    question: 'Есть ли возможность получить возврат средств за отмененное мероприятие?',
    answer:
      'В случае отмены мероприятия вы можете иметь возможность получить возврат средств. Однако, возможность и условия возврата зависят от политики мероприятия и могут быть указаны на странице события или в сообщении об отмене.',
    isActive: false
  },
  {
    id: 9,
    question: 'Как получить информацию о расписании мероприятия и докладчиках?',
    answer:
      'Расписание мероприятия и информацию о докладчиках вы можете найти на странице события. Там будет представлена детальная программа, список докладчиков, их биографии и другая полезная информация.',
    isActive: false
  }
])

const advantages: {
  id: number
  title: string
  text: string
  icon: string
}[] = [
  {
    id: 1,
    title: 'Легкость доступа к информации',
    text: 'Сайт мероприятий предоставляет удобный и легкий доступ к информации о мероприятии. Участники могут получить подробную информацию о дате, времени, месте проведения, расписании, докладчиках и других деталях события.',
    icon: 'database'
  },
  {
    id: 2,
    title: 'Легкость доступа к информации',
    text: 'Сайт мероприятий предоставляет средства коммуникации и обратной связи между организаторами и участниками. Участники могут задавать вопросы, отправлять запросы или получать дополнительную информацию через контактные формы.',
    icon: 'users'
  },
  {
    id: 3,
    title: 'Повышение видимости мероприятия',
    text: 'Организаторы мероприятий могут использовать сайт для продвижения своих событий и повышения их видимости. Это позволяет достичь более широкой аудитории, привлечь больше участников и повысить общую известность о мероприятии.',
    icon: 'pie-chart'
  },
]

const toggleAccordion = (id: number) => {
  faq.value.forEach((faq: IFaq) => {
    faq.isActive = faq.id === id ? !faq.isActive : false
  })
}
</script>

<style lang="scss">
.faqs {
  &__wrapper{
    padding-top: 75px;
    padding-bottom: 90px;
  }
}
</style>
